WEATHER_YANDEX_SMILE = {'Гроза': "🌩",
                        'Ливень': "🌧",
                        'Дождь': "💦",
                        'Облачно с прояснениями': '⛅',
                        'Дождь с грозой': '⛈',
                        'Ясно': '☀',
                        'Пасмурно': '☁',
                        'Малооблачно': "🌤",
                        'Небольшой дождь': "💧",
                        'Небольшой снег': "❄️",
                        'Снег': "🌨"}

WEATHER_GISMETEO_SMILE = {'Ясно': "☀",
                          'Безоблачно': "☀",
                          'Гроза': "🌩",
                          'Дождь': "💦",
                          'Ливень': "🌧",
                          'Малооблачно': "🌤",
                          'Малооблачно, дождь': "💦",
                          'Малооблачно,  дождь': "💦",
                          'Малооблачно,  дождь, гроза': "⛈",
                          'Малооблачно, дождь, гроза': "⛈",
                          'Малооблачно, без осадков': "🌤",
                          'Малооблачно, небольшой  дождь': "💧",
                          'Малооблачно, небольшой  дождь, гроза': "💧⚡️",
                          'Небольшой дождь': "💧",
                          'Облачно с прояснениями': "⛅",
                          'Облачно, небольшой  дождь': "🌥💧",
                          'Облачно, дождь': "🌥💦",
                          'Облачно,  дождь': "🌥💦",
                          'Облачно, дождь, гроза': "🌥💦️⚡️",
                          'Облачно, без осадков': "🌥",
                          'Облачно, небольшой дождь': "🌥💧",
                          'Облачно, сильный  дождь': "🌧",
                          'Облачно, сильный дождь, гроза': "⛈",
                          'Облачно, небольшой  снег': "❄️",
                          'Облачно,  мокрый снег': "❄️💧",
                          'Пасмурно': "☁",
                          'Пасмурно, без осадков': '☁',
                          'Пасмурно, небольшой  дождь': "☁💧",
                          'Пасмурно,  дождь': "☁💦",
                          'Пасмурно, дождь, гроза': "☁💦⚡️",
                          'Пасмурно, сильный  дождь': "🌧",
                          'Пасмурно, сильный  дождь, гроза': "⛈",
                          'Пасмурно, сильный  мокрый снег': "🌨💧",
                          }

WEATHER_GISMETEO_EXCEPTIONS = {'Малооблачно,  дождь',
                               'Малооблачно,  дождь, гроза',
                               'Облачно,  дождь'}

SET_CITIES = {"Москва", "Екатеринбург", "Краснодар"}

SET_TYPES = {"GisMeteo", "Yandex"}

TRANSLATE_CITIES = {"Москва": "Moscow",
                    "Екатеринбург": "Ekaterinburg",
                    "Краснодар": "Krasnodar"}